---
kind: method
id: M:Autodesk.Revit.DB.FillPattern.#ctor(Autodesk.Revit.DB.FillPattern)
source: html/eb7e1a07-a963-9e4e-8c12-e09f5cfeec10.htm
---
# Autodesk.Revit.DB.FillPattern.#ctor Method

Constructs a new copy of the input FillPattern object.

## Syntax (C#)
```csharp
public FillPattern(
	FillPattern other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.FillPattern`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null